// Compact isometric desktop; each frame uses terminal cells.
export default {
  name: 'Isometric desktop',
  width: 10,
  height: 4,
  frameMs: 400,
  frames: [
    {
      rows: [' ╱──────╱│', '┌──────┐▒│', '│ oᴗo  │▒┘', '└──────┘╱ '],
      fg: ['.imfffffii', 'iiiiiiiimi', 'i.iii..imi', 'iiiiiiiii.'],
      bg: ['..........', '........2.', '.111111.2.', '..........'],
    },
    {
      rows: [' ╱──────╱│', '┌──────┐▒│', '│ oᴗo  │▒┘', '└──────┘╱ '],
      fg: ['.ifmffffii', 'iiiiiiiimi', 'i.iii..imi', 'iiiiiiiii.'],
      bg: ['..........', '........2.', '.111111.2.', '..........'],
    },
    {
      rows: [' ╱──────╱│', '┌──────┐▒│', '│ oᴗo  │▒┘', '└──────┘╱ '],
      fg: ['.iffmfffii', 'iiiiiiiimi', 'i.iii..imi', 'iiiiiiiii.'],
      bg: ['..........', '........2.', '.111111.2.', '..........'],
    },
    {
      rows: [' ╱──────╱│', '┌──────┐▒│', '│ oᴗo  │▒┘', '└──────┘╱ '],
      fg: ['.ifffmffii', 'iiiiiiiimi', 'i.iii..imi', 'iiiiiiiii.'],
      bg: ['..........', '........2.', '.111111.2.', '..........'],
    },
    {
      rows: [' ╱──────╱│', '┌──────┐▒│', '│ oᴗo  │▒┘', '└──────┘╱ '],
      fg: ['.iffffmfii', 'iiiiiiiimi', 'i.iii..imi', 'iiiiiiiii.'],
      bg: ['..........', '........2.', '.111111.2.', '..........'],
    },
    {
      rows: [' ╱──────╱│', '┌──────┐▒│', '│ oᴗo  │▒┘', '└──────┘╱ '],
      fg: ['.ifffffmii', 'iiiiiiiimi', 'i.iii..imi', 'iiiiiiiii.'],
      bg: ['..........', '........2.', '.111111.2.', '..........'],
    },
    {
      rows: [' ╱──────╱│', '┌──────┐▒│', '│ oᴗo  │▒┘', '└──────┘╱ '],
      fg: ['.ifffffmii', 'iiiiiiiimi', 'i.iii..imi', 'iiiiiiiii.'],
      bg: ['..........', '........2.', '.111111.2.', '..........'],
    },
    {
      rows: [' ╱──────╱│', '┌──────┐▒│', '│ oᴗo  │▒┘', '└──────┘╱ '],
      fg: ['.ifffffmii', 'iiiiiiiimi', 'i.iii..imi', 'iiiiiiiii.'],
      bg: ['..........', '........2.', '.111111.2.', '..........'],
    },
    {
      rows: [' ╱──────╱│', '┌──────┐▒│', '│ -ᴗ-  │▒┘', '└──────┘╱ '],
      fg: ['.ifffffmii', 'iiiiiiiimi', 'i.iii..imi', 'iiiiiiiii.'],
      bg: ['..........', '........2.', '.111111.2.', '..........'],
    },
    {
      rows: [' ╱──────╱│', '┌──────┐▒│', '│ oᴗo  │▒┘', '└──────┘╱ '],
      fg: ['.ifffffmii', 'iiiiiiiimi', 'i.iii..imi', 'iiiiiiiii.'],
      bg: ['..........', '........2.', '.111111.2.', '..........'],
    },
    {
      rows: [' ╱──────╱│', '┌──────┐▒│', '│ oᴗo  │▒┘', '└──────┘╱ '],
      fg: ['.ifffffmii', 'iiiiiiiimi', 'i.iii..imi', 'iiiiiiiii.'],
      bg: ['..........', '........2.', '.111111.2.', '..........'],
    },
    {
      rows: [' ╱──────╱│', '┌──────┐▒│', '│ oᴗo  │▒┘', '└──────┘╱ '],
      fg: ['.ifffffmii', 'iiiiiiiimi', 'i.iii..imi', 'iiiiiiiii.'],
      bg: ['..........', '........2.', '.111111.2.', '..........'],
    },
  ],
  still: 0,
};
